xmlmesh/server/test/test-subscribe.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:x="http://obtools.com/ns/xmlmesh">
  <env:Header>
    <x:routing env:mustUnderstand="true" env:relay="true"
               env:role="http://www.w3.org/2003/05/soap-envelope/role/next"
               x:id="foo" x:subject="xmlmesh.subscription.join" x:rsvp="true"/>
  </env:Header>
  <env:Body>
    <x:join subject="test.*"/>
  </env:Body>
</env:Envelope>
